#### DataFrame에서 원소/요소 변경

In [1]:
# 모듈 로딩
import pandas as pd

In [2]:
# 데이터 준비
data = {'name': ['홍길동','마징가','원더우먼'], 
        'job':['의적','로봇', '영웅'],
        'gender': ['남','남','여'],
        'age': [100,200,300],
        'height': [180,300,200] }

In [3]:
# DF로 데이터 저장
dataDF = pd.DataFrame(data)
dataDF

   name job gender  age  height
0   홍길동  의적      남  100     180
1   마징가  로봇      남  200     300
2  원더우먼  영웅      여  300     200

#### [원소/요소 값 변경]

In [5]:
## 홍길동 성별 남 => '여' 변경
dataDF.iloc[0, 2] = "여"
dataDF

   name job gender  age  height
0   홍길동  의적      여  100     180
1   마징가  로봇      남  200     300
2  원더우먼  영웅      여  300     200

In [7]:
# 원더우먼 직업 '직장인' 변경
dataDF.iloc[2,1] = '직장인 8ㅅ8'
dataDF

   name      job gender  age  height
0   홍길동       의적      여  100     180
1   마징가       로봇      남  200     300
2  원더우먼  직장인 8ㅅ8      여  300     200

* 행 전체 값 변경

In [9]:
# 인덱스 1인 행 전체 선택 
dataDF.iloc[1], dataDF.loc[1]

(name      마징가
 job        로봇
 gender      남
 age       200
 height    300
 Name: 1, dtype: object,
 name      마징가
 job        로봇
 gender      남
 age       200
 height    300
 Name: 1, dtype: object)

In [10]:
# 인덱스 1인 행 값 변경
dataDF.iloc[1] = ['마징가2', '영웅', '여', 90, 170]
dataDF

   name      job gender  age  height
0   홍길동       의적      여  100     180
1  마징가2       영웅      여   90     170
2  원더우먼  직장인 8ㅅ8      여  300     200

In [11]:
dataDF["height"] = 0
dataDF

   name      job gender  age  height
0   홍길동       의적      여  100       0
1  마징가2       영웅      여   90       0
2  원더우먼  직장인 8ㅅ8      여  300       0

In [12]:
dataDF.height = 92
dataDF

   name      job gender  age  height
0   홍길동       의적      여  100      92
1  마징가2       영웅      여   90      92
2  원더우먼  직장인 8ㅅ8      여  300      92